Repository: adslbarxatov/GeomagDataDrawer
Catalog: src/GeomagDataDrawer_*.resx
Languages: ru_ru

# ProgramSettings_DisableMousePlacing
source: Disable images positioning by mouse (recommended when working on tablet PC)
ru_ru: Отключить позиционирование изображений мышью (рекомендуется при работе на планшетных ПК)

# ProgramSettings_ForceSavingColumnNames
source: Save data columns names in data files
ru_ru: Сохранять имена столбцов в файлах данных

# ProgramSettings_ForceShowDiagram
source: Automatically add curves from default template to diagram (preview)
ru_ru: Автоматически добавлять кривые из стандартного шаблона на диаграмму (предпросмотр)

# ProgramSettings_ForceUsingBackupFile
source: Restore state of application at the next start (diagram data, added curves and objects, etc.)
ru_ru: Восстанавливать состояние программы при следующем запуске (загруженные данные, добавленные кривые, объекты и т.д.)

# ColumnsNamesSelector_Label01
source: Count of first lines of loaded data file, used to search for names of data columns:
ru_ru: Количество первых строк загружаемого файла, используемых для поиска имён столбцов данных:

# ProgramSettings_T
source: Application settings
ru_ru: Настройки программы

# RangeTab_MaxX_TT
source: Field defines maximum abscissa of plotting range
ru_ru: Поле задаёт максимальную абсциссу диапазона построения

# RangeTab_MaxY_TT
source: Field defines maximum ordinate of plotting range
ru_ru: Поле задаёт максимальную ординату диапазона построения

# RangeTab_MinX_TT
source: Field defines minimum abscissa of plotting range
ru_ru: Поле задаёт минимальную абсциссу диапазона построения

# RangeTab_MinY_TT
source: Field defines minimum ordinate of plotting range
ru_ru: Поле задаёт минимальную ординату диапазона построения

# RangeTab_SwapX_TT
source: Button allows you to swap minimum and maximum abscissa of plotting range of selected curve(s) and/or object(s) (reflect X-axis)
ru_ru: Кнопка позволяет обменять местами минимальную и максимальную абсциссы диапазона построения (отразить ось Ox)

# RangeTab_SwapY_TT
source: Button allows you to swap minimum and maximum ordinate of plotting range of selected curve(s) and/or object(s) (reflect Y-axis)
ru_ru: Кнопка позволяет обменять местами минимальную и максимальную ординаты диапазона построения (отразить ось Oy)

# SaveButton
source: &Save
ru_ru: &Сохранить

# SaveCfgFileError
source: Failed to write configuration file. Startup path may be not writable, or file is in use by another program
ru_ru: Не удалось сохранить конфигурацию программы. Возможно, место установки программы защищено от записи, или файл занят другой программой

# SavePicture_A3Horiz
source: Fit image to A3 (landscape)
ru_ru: Подогнать изображение под A3 (альбомный)

# SavePicture_A3Vert
source: Fit image to A3 (portrait)
ru_ru: Подогнать изображение под A3 (книжный)

# SavePicture_A4Horiz
source: Fit image to A4 (landscape)
ru_ru: Подогнать изображение под A4 (альбомный)

# SavePicture_A4Vert
source: Fit image to A4 (portrait)
ru_ru: Подогнать изображение под A4 (книжный)

# SavePicture_CustomSize
source: Save image in scale of
ru_ru: Сохранить изображение в масштабе

# SavePicture_Label01
source: Choose saving variant:
ru_ru: Выберите вариант сохранения:

# SavePicture_SFDialog
source: Specify the location of new diagram image file
ru_ru: Укажите расположение для сохранения изображения

# SavePicture_SFDialog_FR
source: PNG image|*.png
ru_ru: Изображение PNG|*.png

# SavePicture_SFDialog_FV
source: SVG image|*.svg|EMF image|*.emf
ru_ru: Векторное изображение SVG|*.svg|Векторное изображение EMF|*.emf

# SavePicture_T
source: Diagram image saving
ru_ru: Сохранение изображения диаграммы

# SavePicture_VectorImage
source: Save as vector image
ru_ru: Сохранить как векторное изображение

# SizeTab_AlignAsColumn_TT
source: Button allows you to place selected diagram elements vertically, one below the other
ru_ru: Кнопка позволяет расположить выбранные элементы диаграммы вертикально, друг под другом

# SizeTab_AlignAsRow_TT
source: Button allows you to place selected diagram elements horizontally, one after the other
ru_ru: Кнопка позволяет расположить выбранные элементы диаграммы горизонтально, друг за другом

# SizeTab_ImageHeight_TT
source: Field defines height of images of selected curve(s) and/or object(s)
ru_ru: Поле задаёт высоту изображений выбранных элементы диаграммы

# SizeTab_ImageWidth_TT
source: Field defines width of images of selected curve(s) and/or object(s)
ru_ru: Поле задаёт ширину изображений выбранных элементы диаграммы

# SizeTab_LeftOffset_TT
source: Field defines left offset of image(s) of selected diagram element(s) from the left edge of diagram
ru_ru: Поле задаёт смещение изображений выбранных элементов диаграммы относительно левого края диаграммы

# SizeTab_TopOffset_TT
source: Field defines top offset of image(s) of selected diagram element(s) from the top edge of diagram
ru_ru: Поле задаёт смещение изображений выбранных элементов диаграммы относительно верхнего края диаграммы

# StyleLoadingType
source: Select variant of using of style file: • Click “Yes” if you want to apply style(s) to selected diagram element(s); • Click “No” if you want to add new curve(s) with this style(s) to existing curve(s); • Click “Cancel” if you don't need to apply styles
ru_ru: Выберите вариант использования файла стиля: • Нажмите «Да», если необходимо применить стили к выделенным элементам диаграммы; • Нажмите «Нет», если требуется добавить указанные в стилях кривые к уже имеющимся и применить стили к ним; • Нажмите «Отмена», если применять стили не требуется

# StyleSaveError
source: Failed to write diagram style file. Selected location may be not writable, or file with the same name already exists and is in use by another program
ru_ru: Не удалось записать файл стиля диаграммы. Возможно, выбранное расположение недоступно для записи, или файл с данным именем уже существует и занят другой программой

# StylesReset
source: Do you want to reset style(s) of selected curve(s) and object(s) to default settings?
ru_ru: Сбросить стили выбранных кривых и объектов к начальным установкам?

# TemplateSaveError
source: Failed to write curves adding template file. Selected location may be not writable, or file with the same name already exists and is in use by another program
ru_ru: Не удалось записать файл шаблона. Возможно, выбранное расположение недоступно для записи, или файл с данным именем уже существует и занят другой программой

# TextTab_AutoTextOffset_TT
source: Flag indicates whether to automatically calculate placement of image caption and labels for selected curve(s)
ru_ru: Флажок указывает, следует ли автоматически расчитывать позиции подписей изображений выбранных кривых

# TextTab_LineNameLeftOffset_TT
source: Field defines left offset of caption(s) of selected curve(s)
ru_ru: Поле задаёт смещение подписи изображения кривой относительно левого края изображения

# TextTab_LineNameTopOffset_TT
source: Field defines top offset of caption(s) of selected curve(s)
ru_ru: Поле задаёт смещение подписи изображения кривой относительно верхнего края изображения

# TextTab_LineName_TT
source: Field defines caption of selected (one) curve
ru_ru: Поле задаёт подпись к изображению выбранной (одной) кривой

# TextTab_OxTextOffset_TT
source: Field defines top offset of X-axis labels
ru_ru: Поле задаёт смещение подписей оси абсцисс относительно верхнего края изображения

# TextTab_OyTextOffset_TT
source: Field defines left offset of Y-axis labels
ru_ru: Поле задаёт смещение подписей оси ординат относительно левого края изображения

# RangeTab_SwitchXY_TT
source: Flag indicates whether to perform transposition of selected curve(s) (swap abscissas and ordinates)
ru_ru: Флажок указывает, следует ли транспонировать выбранные кривые (обменивать абсциссы и ординаты)

# UnknownFileParametersSelector_Label01
source: Expected data columns count:
ru_ru: Ожидаемое количество столбцов данных:

# UnknownFileParametersSelector_Label02
source: This value can be specified “with reserve”. Missing data columns will be filled with null values
ru_ru: Это значение может быть указано «с запасом». Недостающие столбцы данных будут заполняться нулевыми значениями

# UnknownFileParametersSelector_T
source: Extracting data settings
ru_ru: Параметры извлечения данных

# MUpperHelp_MLanguage_TT
source: Select application interface language
ru_ru: Выбор языка интерфейса программы

# GeomagDataDrawerForm_MainToolTip
source: Purpose
ru_ru: Назначение

# ColumnsNamesSelector_T
source: File loading parameters
ru_ru: Параметры загрузки файла

# FormulaEvaluator_Label01
source: Enter formula for curve generation Allowed: • numbers (with dots or commas); • signs: +, -, *, /, ^, (, ); • functions: sin, cos, tg, ctg, arcsin, arccos, arctg, arcctg, ln, abs; • constants П (pi) and e; • variable name (x)
ru_ru: Введите формулу для генерации кривой Разрешены: • числа (с точками или запятыми); • знаки +, -, *, /, ^, (, ); • функции sin, cos, tg, ctg, arcsin, arccos, arctg, arcctg, ln, abs; • константы П (pi) и e; • имя переменной (x)

# FormulaEvaluator_T
source: Formula for curves generation
ru_ru: Ввод формулы для генерации кривых

# MFile_MClose
source: &Close diagram
ru_ru: Закрыт&ь диаграмму

# MFile_MGenerate
source: &Generate curve(s)...
ru_ru: С&генерировать кривые...

# ExpressionIsEmptyError
source: Expression is empty
ru_ru: Введённое выражение пусто

# IncorrectExpressionEndError
source: Expression is not completed. Lexem “{0:S}” cannot finish an expression
ru_ru: Выражение не завершено. Лексема «{0:S}» не может завершать выражение

# IncorrectExpressionStartError
source: Expression cannot starts with lexem “{0:S}”
ru_ru: Выражение не может начинаться с лексемы «{0:S}»

# LeftParenthesisWasNotClosedError
source: Some opening parenthesis was not closed
ru_ru: Одной или нескольким открывающим скобкам не соответствует закрывающая

# MisplacedConstantError
source: Misplaced constant “{0:S}”
ru_ru: Константа «{0:S}» расположена в недопустимой позиции

# MisplacedDivisionOperatorError
source: Misplaced division operator
ru_ru: Оператор деления расположен в недопустимой позиции

# MisplacedExponentiationOperatorError
source: Misplaced exponentiation operator
ru_ru: Оператор возведения в степень расположен в недопустимой позиции

# MisplacedFunctionCallError
source: Misplaced function call “{0:S}”
ru_ru: Вызов функции «{0:S}» расположен в недопустимой позиции

# MisplacedLeftParenthesisError
source: Misplaced opening parenthesis
ru_ru: Открывающая круглая скобка расположена в недопустимой позиции

# MisplacedMinusOperatorError
source: Misplaced subtraction operator
ru_ru: Оператор вычитания расположен в недопустимой позиции

# MisplacedMultiplicationOperatorError
source: Misplaced multiplication operator
ru_ru: Оператор умножения расположен в недопустимой позиции

# MisplacedNumberError
source: Misplaced number “{0:S}”
ru_ru: Число «{0:S}» расположено в недопустимой позиции

# MisplacedPlusOperatorError
source: Misplaced addition operator
ru_ru: Оператор сложения расположен в недопустимой позиции

# MisplacedRightParenthesisError
source: Misplaced closing parenthesis
ru_ru: Закрывающая круглая скобка расположена в недопустимой позиции

# MisplacedVariableError
source: Misplaced variable
ru_ru: Переменная расположена в недопустимой позиции

source: No errors
ru_ru: Ошибок нет

# UnexpectedRightParenthesisError
source: Unexpected closing parenthesis
ru_ru: Одной или нескольким закрывающим скобкам не соответствует открывающая

# UnknownLexemeError
source: Unknown lexem: “{0:S}”
ru_ru: Неопознанная лексема: «{0:S}»

# IncorrectRangeError
source: Count of curve's points is too big for specified range and step, or range is empty
ru_ru: Для заданных диапазона и шага построения количество точек кривой превышает максимально допустимое, или диапазон пуст

# FormulaEvaluator_Label02
source: Range:
ru_ru: Диапазон:

# FormulaEvaluator_Label03
source: Step:
ru_ru: Шаг:

# FormulaEvaluator_Label04
source: Ready functions:
ru_ru: Готовые функции:

# ColumnsAdder_Radio02
source: Object:
ru_ru: Объект:

# ColumnsAdder_ObjectType_1
source: Rectangle
ru_ru: Прямоугольник

# ColumnsAdder_ObjectType_2
source: Filled rectangle
ru_ru: Залитый прямоугольник

# ColumnsAdder_ObjectType_3
source: Ellipse
ru_ru: Эллипс

# ColumnsAdder_ObjectType_4
source: Filled ellipse
ru_ru: Залитый эллипс

# ColumnsAdder_ObjectType_5
source: Text string
ru_ru: Текстовая строка

# ObjectsOverloadError
source: Maximum of object count ({0:D}) has been reached. Further addition is impossible
ru_ru: Достигнуто максимальное ({0:D}) количество дополнительных объектов на диаграмме. Дальнейшее добавление невозможно

# ColumnsAdder_ObjectType_6
source: Diagonal line (\)
ru_ru: Диагональная линия (\)

# ColumnsAdder_ObjectType_7
source: Diagonal line (/)
ru_ru: Диагональная линия (/)

# ColumnsAdder_ObjectType_8
source: Horizontal line
ru_ru: Горизонтальная линия

# ColumnsAdder_ObjectType_9
source: Vertical line
ru_ru: Вертикальная линия

# FormulaEvaluator_Label05W
source: Points count:
ru_ru: Всего точек:

# MFile_MLoadFromClipboard
source: Load from clip&board
ru_ru: Загрузить из б&уфера обмена

# ClipboardLoadError
source: Clipboard doesn't contain suitable data for diagram
ru_ru: Буфер обмена не содержит данных, подходящих для построения диаграмм

# MFile_MGenerate_TT
source: Generate curve(s) from analytically defined function(s)
ru_ru: Генерация кривых по аналитически заданным функциям

# MFile_MLoadFromClipboard_TT
source: Loading diagram data from clipboard
ru_ru: Загрузка данных диаграммы из буфера обмена

# MFile_MClose_TT
source: Closing current diagram without saving
ru_ru: Закрытие текущей диаграммы без сохранения

# CommandLineHelp
source: Usage from command line: GeomagDataDrawer – for application launch; GeomagDataDrawer /? – to show this message; GeomagDataDrawer <filename> – loading of file «filename»; GeomagDataDrawer <filename> <filename_2> [SLC] [ECC] – data files conversion, from first format to second; [SLC] – lines count for columns names search; will be loaded from configuration if not set; [ECC] – expected count of data columns (for extracting); will be loaded from configuration if not set
ru_ru: Использование из командной строки: GeomagDataDrawer – запуск программы; GeomagDataDrawer /? – отображение этого сообщения; GeomagDataDrawer <имя_файла> – загрузка файла «имя_файла»; GeomagDataDrawer <имя_файла> <имя_файла_2> [SLC] [ECC] – преобразование файлов из первого формата во второй; [SLC] – количество строк, используемых для поиска имён столбцов; если не указан, считывается из конфигурации; [ECC] – ожидаемое количество столбцов данных (для извлечения); если не указан, считывается из конфигурации

# GeomagDataDrawerFormMenuStrip_MOperations
source: O&perations
ru_ru: Оп&ерации

# MOperations_MAddColumn
source: Add curve or object
ru_ru: Добавить кр&ивую или объект

# MOperations_MAddColumnCmd
source: Parametric curve(s) adding
ru_ru: Параметри&ческое добавление кривых

# MOperations_MAddColumnCmd_TT
source: Adding new curve(s) using parameters line
ru_ru: Добавление кривых на диаграмму с помощью строки параметров

# MOperations_MAddColumn_TT
source: Adding new curve or object
ru_ru: Добавление кривой или графического объекта на диаграмму

# MOperations_MDeleteColumn
source: Delete curve(s) and/or object(s)
ru_ru: Удали&ть кривые и объекты

# MOperations_MDeleteColumn_TT
source: Deleting selected curve(s) and/or object(s)
ru_ru: Удаление выбранных кривых и объектов с диаграммы

# MOperations_MMergeLines
source: Merge curve(s) and/or object(s)
ru_ru: Со&вместить кривые или объекты

# MOperations_MMergeLines_TT
source: Merging (overlaying) selected curve(s) and/or object(s)
ru_ru: Совмещение (наложение) кривых и/или объектов

# MOperations_MReplaceColumn
source: Change curve's data columns
ru_ru: Выбор столб&цов данных кривой

# MOperations_MReplaceColumn_TT
source: Changing data columns of selected (single) curve
ru_ru: Изменение столбцов данных, использованных для построения выбранной (одной) кривой

# GeomagDataDrawerForm_OxFormat_2
source: Date
ru_ru: Дата

# UnknownFileParametersSelector_Label03
source: Abscissas column number:
ru_ru: Столбец абсцисс:

# TemplateLoadError
source: Specified file is unavailable
ru_ru: Указанный файл не найден или недоступен

# ShowVideo
source: Do you want to view user videoguide on our YouTube channel?
ru_ru: Показать видеоруководство пользователя на нашем YouTube-канале?

# ExceptionMessage
source: Internal error occurred in application. Debug is required
ru_ru: В приложении произошла внутренняя ошибка. Требуется отладка

# FileAddCompleted
source: File “{0:S}” has been added: columns – {1:D}, rows – {2:D}
ru_ru: Добавлен файл «{0:S}»: столбцов – {1:D}, строк – {2:D}

# FileAddError
source: File “{0:S}” haven't been added: {1:S}
ru_ru: Файл «{0:S}» не был добавлен: {1:S}

# FilesListReset
source: Files list has been reset
ru_ru: Список файлов сброшен

source: Not enough files to merge
ru_ru: Недостаточно файлов для объединения

# TablesAssembling
source: Assembling: file #{0:D}, row #{1:D}
ru_ru: Сборка строк: файл №{0:D}, строка №{1:D}

# TablesMergeCompleted
source: Table has been merged: rows – {0:D}, columns – {1:D}
ru_ru: Сформирована таблица: строк – {0:D}, столбцов – {1:D}

# TablesMergeError
source: There are not enough rows in created table that match the selection criteria
ru_ru: В объединённой таблице недостаточно строк, соответствующих условиям отбора

# TablesMergerForm_AddFiles
source: Add files to processing ...
ru_ru: Добавить файлы в обработку...

# TablesMergerForm_BeginProcessing
source: Begin processing
ru_ru: Начать обработку

# TablesMergerForm_ClearFiles
source: Reset list
ru_ru: Сбросить список

# TablesMergerForm_FilesListLabel
source: List of data files to merge:
ru_ru: Список файлов данных для объединения:

# TablesMergerForm_MergeLabel
source: Merge type:
ru_ru: Вариант объединения:

# TablesMergerForm_MergeType0
source: Use abscissas existent in all files
ru_ru: Использовать абсциссы, имеющиеся во всех файлах

# TablesMergerForm_MergeType1
source: Add missing abscissas, fill ordinates with zeros
ru_ru: Добавлять недостающие абсциссы, заполнять ординаты нулями

# TablesMergerForm_MergeType2
source: Add missing abscissas, interpolate ordinates
ru_ru: Добавлять недостающие абсциссы, интерполировать ординаты

# TablesMergerForm_ProcessingLabel
source: Processing results:
ru_ru: Результаты обработки:

# TablesMergerForm_SaveResult
source: Save result
ru_ru: Сохранить результат

# TablesMerger_Exit
source: Exit the application? All unsaved data will be lost!
ru_ru: Завершить работу с программой? Все несохранённые данные будут утеряны!

# TablesMerger_FileSaved
source: File with result table has been saved
ru_ru: Файл с конечной таблицей сохранён

# TablesMerger_LaunchedAt
source: launched at
ru_ru: запущен в

# TablesMerging
source: Merging rows to table: row #{0:D}
ru_ru: Объединение строк в таблицу: строка №{0:D}

# TablesSorting
source: Rows sorting...
ru_ru: Сортировка строк...

# HelpText
source: Geomag data drawer is a software tool for creating diagrams based on tabular data. Originally created for visualizing the results of experimental measurements. Can now be used for this purpose. But not exclusively...
ru_ru: Geomag data drawer – программное средство, предназначенное для построения диаграмм на основе табличных данных. Изначально создавался как средство визуализации результатов экспериментальных измерений; может и сейчас быть использован с этой целью. Но не только...

# HelpText_TM
source: This tool allows you to merge data tables of different types into single file using columns adding
ru_ru: Этот инструмент позволяет объединять таблицы данных различных типов в единый файл путём добавления столбцов

# MUpperHelp_MRegister
source: Register file associatio&ns
ru_ru: &Ассоциировать файлы

# MUpperHelp_MRegister_TT
source: Add file types to Windows registry and make them openable by double-click
ru_ru: Добавить типы файлов в реестр Windows и сделать их открываемыми по двойному клику

# gddfile
source: Geomag data drawer diagram file
ru_ru: Файл диаграммы Geomag data drawer

# gdsfile
source: Geomag data drawer style file
ru_ru: Файл стиля Geomag data drawer

# TablesMergerForm_SFDialog_F
source: All data files|*.*
ru_ru: Диаграммы с произвольным набором данных (*.dat)|*.dat|Файлы табличных данных Windows CSV|*.csv
