Repository: adslbarxatov/GeomagDataDrawer
Catalog: src/GeomagDataDrawer_*.resx
Languages: ru_ru

# AxesTab_AutoDivisions
source: Auto
ru_ru: Автоопределение

# AxesTab_Label11
source: Axes divisions count:
ru_ru: Число делений на осях:

# AxesTab_Label12
source: Ox, primary:
ru_ru: Ox, основные:

# AxesTab_Label13
source: Oy, primary:
ru_ru: Oy, основные:

# AxesTab_Label14
source: Ox, secondary:
ru_ru: Ox, дополнительные:

# AxesTab_Label15
source: Oy, secondary:
ru_ru: Oy, дополнительные:

# AxesTab_Label16
source: Axes thickness:
ru_ru: Толщина осей:

# AxesTab_Label17
source: Axes color:
ru_ru: Цвет осей:

# AxesTab_Label18
source: Axes placement:
ru_ru: Расположение осей:

# AxesTab_Label21
source: Formats of axes labels:
ru_ru: Форматы подписей осей:

# FontTab_AxesFont
source: Axes labels font
ru_ru: Шрифт подписей осей

# FontTab_Label27
source: Fonts and colors:
ru_ru: Шрифты и цвета подписей:

# FontTab_TextFont
source: Image caption font
ru_ru: Шрифт подписи изображения

# GridTab_Label24
source: Grid lines thickness:
ru_ru: Толщина линий сетки:

# GridTab_Label25
source: Primary lines color:
ru_ru: Цвет основных линий:

# GridTab_Label26
source: Secondary lines color:
ru_ru: Цвет дополнительных линий:

# LineTab_Label28
source: Thickness:
ru_ru: Толщина:

# LineTab_Label29
source: Color:
ru_ru: Цвет:

# LineTab_Label30
source: Style:
ru_ru: Стиль:

# LineTab_Label31
source: Marker:
ru_ru: Маркер:

# GeomagDataDrawerFormMenuStrip_MFile
source: &File
ru_ru: &Файл

# GeomagDataDrawerFormMenuStrip_MUpperHelp
source: &Help
ru_ru: &Помощь

# GeomagDataDrawerForm_LineStyle_0
source: Line only
ru_ru: Только линия

# GeomagDataDrawerForm_LineStyle_1
source: Line and markers
ru_ru: Линия и маркеры

# GeomagDataDrawerForm_LineStyle_2
source: Markers only
ru_ru: Только маркеры

# GeomagDataDrawerForm_LoadStyleDialog
source: Choose diagram style file
ru_ru: Выберите файл стиля

# GeomagDataDrawerForm_OFDialog
source: Choose data file
ru_ru: Выберите файл данных

# GeomagDataDrawerForm_OFDialog_F
source: {0:S} data files (*.{1:S})|*.{1:S}|Microsoft Excel format '97 и '07|*.xls;*.xlsx|Windows CSV tables|*.csv|Extracting data from text files|*.*
ru_ru: Файлы данных {0:S} (*.{1:S})|*.{1:S}|Файлы Microsoft Excel '97 и '07|*.xls;*.xlsx|Файлы табличных данных Windows CSV|*.csv|Извлечение данных из текстовых файлов|*.*

# GeomagDataDrawerForm_OxFormat_0
source: Simple
ru_ru: Простой

# GeomagDataDrawerForm_OxFormat_1
source: Exponential
ru_ru: Экспоненциальный

# GeomagDataDrawerForm_OxPlacement_0
source: Auto
ru_ru: Автоматически

# GeomagDataDrawerForm_OxPlacement_1
source: Top
ru_ru: Сверху

# GeomagDataDrawerForm_OxPlacement_2
source: Bottom
ru_ru: Снизу

# GeomagDataDrawerForm_OxPlacement_3
source: Center
ru_ru: По центру

# GeomagDataDrawerForm_OyPlacement_0
source: Auto
ru_ru: Автоматически

# GeomagDataDrawerForm_OyPlacement_1
source: Left
ru_ru: Слева

# GeomagDataDrawerForm_OyPlacement_2
source: Right
ru_ru: Справа

# GeomagDataDrawerForm_OyPlacement_3
source: Middle
ru_ru: Посередине

# GeomagDataDrawerForm_SaveStyleDialog
source: Specify the location of new style file
ru_ru: Укажите расположение для сохранения файла стиля

# GeomagDataDrawerForm_SFDialog
source: Specify the location of new data file
ru_ru: Укажите расположение для сохранения файла данных

# GeomagDataDrawerForm_SFDialog_F
source: {0:S} data files (*.{1:S})|*.{1:S}|Random data set diagrams (*.dat)|*.dat|Windows CSV tables|*.csv
ru_ru: Файлы данных {0:S} (*.{1:S})|*.{1:S}|Диаграммы с произвольным набором данных (*.dat)|*.dat|Файлы табличных данных Windows CSV|*.csv

# GeomagDataDrawerForm_StyleDialog_F
source: Diagram style files (*.{0:S})|*.{0:S}
ru_ru: Файлы стилей диаграмм (*.{0:S})|*.{0:S}

# MainTabControl_AxesTab_TT
source: Axes panel
ru_ru: Панель настройки координатных осей

# MainTabControl_FontTab_TT
source: Fonts and colors panel
ru_ru: Панель настройки шрифта и цвета подписей

# MainTabControl_GridTab_TT
source: Grid panel
ru_ru: Панель настройки координатной сетки

# MainTabControl_LineTab_TT
source: Lines panel
ru_ru: Панель настройки линий

# MainTabControl_RangeTab_TT
source: Plotting range panel
ru_ru: Панель задания диапазона построения

# MainTabControl_SizeTab_TT
source: Placements and dimensions panel
ru_ru: Панель задания размера и расположения изображения

# MainTabControl_TextTab_TT
source: Labels and captions panel
ru_ru: Панель настройки подписей

# MFile_MExit
source: E&xit
ru_ru: В&ыход

# MOperations_MLoadStyle
source: &Load style...
ru_ru: &Загрузить стиль...

# MFile_MOpenDataFile
source: &Open data file...
ru_ru: &Открыть файл данных...

# MFile_MProgramSettings
source: Se&ttings
ru_ru: Настро&йки программы

# MOperations_MRedactData
source: &Edit diagram data...
ru_ru: Реда&ктировать данные диаграммы...

# MOperations_MResetStyle
source: &Reset style
ru_ru: С&бросить стиль

# MFile_MSaveDataFile
source: &Save data file...
ru_ru: &Сохранить файл данных...

# MFile_MSaveDiagramImage
source: Save diagram &image...
ru_ru: Сохранить &диаграмму...

# MOperations_MSaveStyle
source: Save st&yle...
ru_ru: Сохранить сти&ль...

# MOperations_MSaveTemplate
source: Save curves adding te&mplate...
ru_ru: Сохранить &шаблон добавления кривых...

# MUpperHelp_MAbout
source: &About
ru_ru: О програ&мме

# MUpperHelp_MHelp
source: &User manual
ru_ru: Сп&равка

# RangeTab_Label01
source: Plotting ranges:
ru_ru: Диапазоны построения:

# SizeTab_AlignAsColumn
source: Arrange in column
ru_ru: Расположить в столбец

# SizeTab_AlignAsRow
source: Arrange in row
ru_ru: Расположить в ряд

# SizeTab_Label02
source: Image placement and dimensions:
ru_ru: Размер и смещение изображения:

# SizeTab_Label03
source: left offset:
ru_ru: отступ слева:

# SizeTab_Label04
source: top offset:
ru_ru: отступ сверху:

# SizeTab_Label05
source: width:
ru_ru: ширина:

# SizeTab_Label06
source: height:
ru_ru: высота:

# TextTab_AutoTextOffset
source: Auto
ru_ru: Автоопределение

# TextTab_Label07
source: X-axis labels offset:
ru_ru: Смещение подписей оси Ox:

# TextTab_Label08
source: Y-axis labels offset:
ru_ru: Смещение подписей оси Oy:

# TextTab_Label09
source: Image caption:
ru_ru: Подпись изображения:

# TextTab_Label10
source: Caption placement:
ru_ru: Координаты подписи:

# RangeTab_SwitchXY
source: Perform curve transposition
ru_ru: Выполнить транспонирование кривой

# AbortButton
source: &Cancel
ru_ru: От&мена

# AbortChanges
source: This will cancel all changes made. Are you sure?
ru_ru: Все несохранённые изменения будут утеряны. Продолжить?

# ApplicationExit
source: Exit the application?
ru_ru: Завершить работу с программой?

# ApplyButton
source: &OK
ru_ru: &ОК

# ApplyChanges
source: Save all changes made?
ru_ru: Сохранить внесённые изменения?

# AxesTab_AutoDivisions_TT
source: Flag indicates whether or not to automatically set count of primary divisions
ru_ru: Флажок указывает, следует ли автоматически определять число основных делений

# AxesTab_AxesColorTurnOff_TT
source: Button allows you to hide axes
ru_ru: Кнопка позволяет скрыть оси

# AxesTab_AxesColor_TT
source: Button allows you to set color of axes lines
ru_ru: Кнопка позволяет задать цвет линий осей

# AxesTab_AxesWidth_TT
source: Field defines thickness of axes lines
ru_ru: Поле задаёт толщину линий осей

# AxesTab_OxFormatCombo_TT
source: Field defines display format of values on X-axis
ru_ru: Поле задаёт формат отображения значений на оси Ox

# AxesTab_OxPlacementCombo_TT
source: Field defines placement of X-axis on selected curve(s) image(s)
ru_ru: Поле задаёт расположение оси Ox на изображении кривой

# AxesTab_OxPrimaryDiv_TT
source: Field defines count of primary divisions on X-axis
ru_ru: Поле задаёт количество основных делений на оси Ox

# AxesTab_OxSecondaryDiv_TT
source: Field defines count of secondary divisions on X-axis
ru_ru: Поле задаёт количество дополнительных делений на оси Ox

# AxesTab_OyFormatCombo_TT
source: Field defines display format of values on Y-axis
ru_ru: Поле задаёт формат отображения значений на оси Oy

# AxesTab_OyPlacementCombo_TT
source: Field defines placement of Y-axis on selected curve(s) image(s)
ru_ru: Поле задаёт расположение оси Oy на изображении кривой

# AxesTab_OyPrimaryDiv_TT
source: Field defines count of primary divisions on Y-axis
ru_ru: Поле задаёт количество основных делений на оси Oy

# AxesTab_OySecondaryDiv_TT
source: Field defines count of secondary divisions on Y-axis
ru_ru: Поле задаёт количество дополнительных делений на оси Oy

# BrokenFileError
source: file cannot be loaded because of one of following reasons: • file is corrupted, is empty, or it's data were not arranged in a single table (for Microsoft Excel files); • the file contains non-numeric value, or has an unequal number of columns in rows (for all files); probably, you have specified too low count of lines that are used to search data columns names • broken structure of file, or file version is not supported (for program files)
ru_ru: указанный файл не может быть загружен по одной из следующих причин: • файл повреждён, пуст, или данные в нём не были упорядочены в единую таблицу (для файлов Microsoft Excel); • файл содержит нечисловые значения или имеет неодинаковое число столбцов в строках (для всех файлов); возможно, указано слишком маленькое количество строк, используемых для поиска названий столбцов данных; • нарушена структура файла, или версия файла не поддерживается (для файлов программы)

# BrokenStyleError
source: Specified style file is not available or is damaged. Some elements of styles was not loaded
ru_ru: Указанный файл стиля недоступен или повреждён. Загружены не все элементы стилей

# BrokenTableError
source: some values in table is invalid. Correct wrong values and try again
ru_ru: некоторые значения в таблице введены некорректно. Исправьте ошибки и повторите попытку

# ColumnNameInput_AbortName_TT
source: Retain original column name
ru_ru: Сохранить исходное имя столбца

# ColumnNameInput_ApplyName_TT
source: Apply new column name
ru_ru: Применить новое имя столбца

# ColumnNameInput_Label01
source: Enter column name:
ru_ru: Введите имя столбца:

# ColumnsAdderCmd_Correct
source: Parameters are correct
ru_ru: Параметры заданы корректно

# ColumnsAdderCmd_DescrLabel
source: Parameters are separated by semicolons, with no spaces, as follows: column number for X-axis, column number for Y-axis, image width, image height, left offset of image, top offset of image. Optional: image caption, left offset of caption, top offset of caption
ru_ru: Параметры вводятся через точку с запятой, без пробелов, в следующей последовательности: номер столбца абсцисс, номер столбца ординат, ширина изображения, высота изображения, левое смещение изображения, верхнее смещение изображения. Опционально: подпись изображения, левое смещение подписи, верхнее смещение подписи

# ColumnsAdderCmd_ICNError
source: One of data column numbers is incorrect
ru_ru: Один из номеров столбцов задан некорректно

# ColumnsAdderCmd_IDOError
source: One of image offsets is incorrect
ru_ru: Одно из смещений диаграммы задано некорректно

# ColumnsAdderCmd_IDSError
source: One of image dimensions is incorrect
ru_ru: Один из размеров диаграммы задан некорректно

# ColumnsAdderCmd_IPCError
source: Count of parameters is incorrect
ru_ru: Некорректное число параметров

# ColumnsAdderCmd_ITOError
source: One of caption offsets is incorrect
ru_ru: Одно из смещений подписи задано некорректно

# ColumnsAdderCmd_Label01
source: Errors:
ru_ru: Ошибки:

# ColumnsAdderCmd_MultiCmd
source: Specify template file to add new curves:
ru_ru: Укажите файл шаблона для добавления новых кривых:

# ColumnsAdderCmd_OCNError
source: One of column numbers is out of range: [1; {0:D}]
ru_ru: Один из номеров столбцов выходит за допустимый диапазон: [1; {0:D}]

# ColumnsAdderCmd_ODOError
source: One of image offsets is out of range: [0; {0:D}] and [0; {1:D}]
ru_ru: Одно из смещений диаграммы выходит за допустимый диапазон: [0; {0:D}] и [0; {1:D}]

# ColumnsAdderCmd_ODSError
source: One of image dimensions is out of range: [{0:D}; {1:D}] and [{2:D}; {3:D}]
ru_ru: Один из размеров диаграммы выходит за допустимый диапазон: [{0:D}; {1:D}] и [{2:D}; {3:D}]

# ColumnsAdderCmd_OFDialog
source: Choose template file
ru_ru: Выберите файл шаблона

# ColumnsAdderCmd_OFDialog_F
source: Curves adding templates (*.txt)|*.txt
ru_ru: Шаблоны добавления кривых (*.txt)|*.txt

# ColumnsAdderCmd_OTOError
source: One of caption offsets is out of range: [0; {0:D}] and [0; {1:D}]
ru_ru: Одно из смещений подписи диаграммы выходит за допустимый диапазон: [0; {0:D}] и [0; {1:D}]

# ColumnsAdderCmd_ProcessingMsg
source: (enter curve parameters)
ru_ru: (введите параметры кривой)

# ColumnsAdderCmd_ProcessingResults
source: (choose template file)
ru_ru: (выберите файл шаблона)

# ColumnsAdderCmd_SelectFile
source: &File
ru_ru: &Файл

# ColumnsAdderCmd_SFDialog
source: Specify the location of new template file
ru_ru: Укажите расположение нового файла шаблона

# ColumnsAdderCmd_SingleCmd
source: Enter parameters of new curve:
ru_ru: Введите параметры новой кривой:

# ColumnsAdderCmd_T
source: New curve parameters
ru_ru: Параметры новой кривой

# ColumnsAdder_Radio01
source: Curve based on:
ru_ru: Кривая на основе данных:

# ColumnsAdder_TE
source: Choosing new data for current curve
ru_ru: Выбор новых данных для текущей кривой

# ColumnsAdder_TN
source: Add new curve or object
ru_ru: Добавление кривой или объекта

# CriticalComponentsError
source: Missing required component of the program: {0:S}. Probably, you need to reinstall it
ru_ru: Отсутствует необходимый компонент программы: {0:S}. Возможно, требуется переустановить программу

# DataFileLoadError
source: File “{0:S}” loading error: {1:S}
ru_ru: Ошибка загрузки файла «{0:S}»: {1:S}

# DataFileSaveError
source: Failed to write data file. Selected location may be not writable, or file with the same name already exists and is in use by another program
ru_ru: Не удалось записать файл данных. Возможно, выбранное расположение недоступно для записи, или файл с данным именем уже существует и занят другой программой

# DataProcessingError
source: Data processing error: {0:S}
ru_ru: Ошибка обработки данных: {0:S}

# DiagramDataEditor_AbortButton_TT
source: Cancel all changes made and close editing window
ru_ru: Отменить все внесённые изменения и закрыть окно редактирования

# DiagramDataEditor_AddRowAfter_TT
source: Add new row after the current
ru_ru: Добавить новую строку после текущей

# DiagramDataEditor_AddRowBefore_TT
source: Add new row before the current
ru_ru: Добавить новую строку перед текущей

# DiagramDataEditor_DeleteRow_TT
source: Delete selected rows
ru_ru: Удалить выбранные строки

# DiagramDataEditor_MoveRowDown_TT
source: Move the row down
ru_ru: Опустить строку на одну позицию вниз

# DiagramDataEditor_MoveRowUp_TT
source: Move the row up
ru_ru: Поднять строку на одну позицию вверх

# DiagramDataEditor_SaveButton_TT
source: Apply all changes made and rebuild diagram
ru_ru: Применить все внесённые изменения и перестроить диаграмму

# DiagramDataEditor_T
source: Diagram data editing
ru_ru: Редактирование данных диаграммы

# DiagramMerger_PaintingAxes
source: Paint axes labels using colors of corresponding curves
ru_ru: Окрашивать подписи осей цветами соответствующих кривых

# DiagramMerger_T
source: Curves and objects merging options
ru_ru: Параметры совмещения кривых и объектов

# ExcelNotAvailableError
source: Microsoft Excel format support components are missing
ru_ru: файлы поддержки формата Microsoft Excel отсутствуют

# FileNotAvailableError
source: specified file not found or not available
ru_ru: указанный файл не найден или недоступен

# FontSelectError
source: Unable to use selected font for plotting. Select another font or cancel the action
ru_ru: Не удаётся использовать выбранный шрифт для построения диаграммы. Выберите другой шрифт или отмените действие

# FontTab_AxesFontColor_TT
source: Button allows you to set axes labels color
ru_ru: Кнопка позволяет задать цвет подписей осей

# FontTab_AxesFont_TT
source: Button allows you to set axes labels font
ru_ru: Кнопка позволяет задать шрифт подписей осей

# FontTab_TextFontColor_TT
source: Button allows you to set caption color
ru_ru: Кнопка позволяет задать цвет подписи изображения

# FontTab_TextFont_TT
source: Button allows you to set caption font
ru_ru: Кнопка позволяет задать шрифт подписи изображения

# GridTab_GridColorTurnOff_TT
source: Button allows you to hide grid lines
ru_ru: Кнопка позволяет скрыть линии сетки

# GridTab_GridPrimaryColor_TT
source: Button allows you to set color of primary grid lines
ru_ru: Кнопка позволяет задать цвет основных линий сетки

# GridTab_GridSecondaryColor_TT
source: Button allows you to set color of secondary grid lines
ru_ru: Кнопка позволяет задать цвет дополнительных линий сетки

# GridTab_GridWidth_TT
source: Field defines grid lines thickness
ru_ru: Поле задаёт толщину линий сетки

# HelpFileError
source: Help file not found or not available. Make sure the file exists and is available, or reinstall the application
ru_ru: Не удалось открыть руководство пользователя. Проверьте ваше интернет-соединение

# ImageSaveError
source: Failed to write diagram image file. Selected location may be not writable, or file with the same name already exists and is in use by another program
ru_ru: Не удалось сохранить изображение диаграммы. Возможно, выбранное расположение недоступно для записи, или файл с данным именем уже существует и занят другой программой

# IncorrectValueError
source: Entered value is incorrect. Enter a valid integer or float value or press [Esc] key to return to original value
ru_ru: Значение введено с ошибкой. Введите допустимое целое или дробное значение или нажмите клавишу [Esc] для возврата первоначального значения

# LineForReplaceNSError
source: You must select curve to perform data columns change
ru_ru: Не выбрана кривая для изменения столбцов данных

# LinesDelete
source: Do you really want to delete selected curve(s) and/or object(s)?
ru_ru: Удалить выбранные кривые и/или объекты?

# LinesForDeleteNSError
source: You must select curve(s) and/or object(s) for deleting
ru_ru: Не выбраны кривые и/или объекты для удаления

# LinesForLoadingStylesNSError
source: You must select curve(s) and/or object(s) for importing style(s)
ru_ru: Не выбраны кривые и/или объекты для импорта стилей

# LinesForResetStylesNSError
source: You must select curve(s) and/or object(s) for resetting style(s)
ru_ru: Не выбраны кривые и/или объекты для сброса стилей

# LinesForSavingStylesNSError
source: You must select curve(s) and/or object(s) for exporting style(s)
ru_ru: Не выбраны кривые и/или объекты для экспорта стилей

# LinesForSettingNSError
source: You must select curve(s) adn/or object(s) for setting
ru_ru: Не выбраны кривые и/или объекты для настройки

# LinesOverloadError
source: Maximum of curves count ({0:D}) has been reached. Further addition is impossible
ru_ru: Достигнуто максимальное ({0:D}) количество кривых на диаграмме. Дальнейшее добавление невозможно

# LineTab_LineColor_TT
source: Button allows you to set line(s) color
ru_ru: Кнопка позволяет задать цвет линии

# LineTab_LineMarker_TT
source: Field defines curve(s) line marker
ru_ru: Поле задаёт маркер, используемый для построения кривой

# LineTab_LineStyleCombo_TT
source: Field defines curve(s) line type
ru_ru: Поле задаёт формат отображения линии кривой

# LineTab_LineWidth_TT
source: Field defines line(s) line thickness
ru_ru: Поле задаёт толщину линии

# GeomagDataDrawerForm_AddColumnCmd_TT
source: Button allows you to add new curve(s) using parameters line
ru_ru: Кнопка позволяет добавить новую кривую с помощью строки параметров

# GeomagDataDrawerForm_AddColumn_TT
source: Button allows you to add new curve or object
ru_ru: Кнопка позволяет добавить новую кривую или новый объект на диаграмму

# GeomagDataDrawerForm_DeleteColumn_TT
source: Button allows you to delete selected curve(s) and/or object(s)
ru_ru: Кнопка позволяет удалить выбранные кривые и/или объекты с диаграммы

# GeomagDataDrawerForm_DrawLine_TT
source: Switch defines whether to display selected curve(s) and/or object(s)
ru_ru: Переключатель указывает, следует ли отображать выбранные кривые и/или объекты на диаграмме

# GeomagDataDrawerForm_LineNamesList_TT
source: Field contains names of curves and objects that have been added to diagram; curves and objects, editable at the moment, are highlighted
ru_ru: Поле содержит названия кривых и объектов, добавленных на диаграмму; кривые и объекты, редактируемые в данный момент, выделены цветом

# GeomagDataDrawerForm_MergeLines_TT
source: Button allows you to merge selected curve(s) and/or object(s)
ru_ru: Кнопка позволяет совместить выбранные кривые и/или объекты

# GeomagDataDrawerForm_ReplaceColumn_TT
source: Button allows you to change data columns of selected (single) curve
ru_ru: Кнопка позволяет изменить столбцы данных, использованные для построения выбранной (одной) кривой

# GeomagDataDrawerForm_SelectionMode_TT
source: Switch indicates that cursor is in selection mode
ru_ru: Переключатель указывает, что курсор мыши находится в режиме выбора

# MergingAxes_Label01
source: Axes of merging:
ru_ru: Оси совмещения:

# MergingAxes_OxOy
source: Both
ru_ru: Обе

# MergingError
source: To perform merge you must select exactly two diagram elements
ru_ru: Для выполнения совмещения необходимо выбрать ровно два элемента диаграммы

# MergingVariant_Label02
source: Merging variant:
ru_ru: Вариант совмещения:

# MergingVariant_Line
source: In place of
ru_ru: На месте кривой

# MFile_MExit_TT
source: Exiting the application
ru_ru: Завершение работы с программой

# MOperations_MLoadStyle_TT
source: Load style(s) from file
ru_ru: Загрузка стиля диаграммы из файла

# MFile_MOpenDataFile_TT
source: Choose data file for plotting
ru_ru: Выбор файла данных для построения диаграммы

# MFile_MProgramSettings_TT
source: Application settings
ru_ru: Настройки программы

# MOperations_MRedactData_TT
source: Diagram data editing
ru_ru: Редактирование данных диаграммы

# MOperations_MResetStyle_TT
source: Return default settings for style(s) of selected curve(s) and object(s)
ru_ru: Сброс параметров стилей выбранных кривых и объектов до стандартных значений

# MFile_MSaveDataFile_TT
source: Save diagram data to file
ru_ru: Сохранение данных диаграммы в файл

# MFile_MSaveDiagramImage_TT
source: Save diagram image to file
ru_ru: Сохранение изображения диаграммы в файл

# MOperations_MSaveStyle_TT
source: Save style(s) of selected curve(s) and object(s) to file
ru_ru: Сохранение стиля выбранных кривых и объектов в файл

# MOperations_MSaveTemplate_TT
source: Save curves adding template to file
ru_ru: Сохранение шаблона добавления кривых в файл

# MUpperHelp_MAbout_TT
source: Show short application info
ru_ru: Отображение сведений о программе

# MUpperHelp_MHelp_TT
source: Show help file
ru_ru: Отображение файла справки

# NotEnoughDataError
source: file contains an insufficient count of rows and / or columns of data, or you have specified too high count of lines that are used to search data columns names
ru_ru: указанный файл содержит недостаточное количество строк и/или столбцов данных. Возможно, указано слишком большое количество строк, используемых для поиска названий столбцов данных

# NotEnoughRowsError
source: At least two rows are necessary to plotting
ru_ru: Для построения диаграммы необходимо не менее двух строк

# NotInitedError
source: no data for plotting. Choose data file and try again
ru_ru: нет данных для отображения. Выберите файл данных и повторите попытку

# ProgramLaunchedError
source: {0:S} is already running
ru_ru: Программа {0:S} уже запущена

# ProgramSettings_ConfirmExit
source: Request exiting confirmation
ru_ru: Требовать подтверждение выхода из программы
